2018-03-25 11:28:35.480469
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1_input (InputLayer)  (None, 19, 19, 38)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 19, 19, 128)       121728    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 19, 19, 1)         129       
_________________________________________________________________
flatten_1 (Flatten)          (None, 361)               0         
_________________________________________________________________
biais_1 (Biais)              (None, 361)               361       
_________________________________________________________________
activation_1 (Activation)    (None, 361)               0         
=================================================================
Total params: 860,138
Trainable params: 860,138
Non-trainable params: 0
_________________________________________________________________
sur 231261 coups et 10 epochs