2018-03-22 22:19:54.394809
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 19, 19, 128)       147328    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 19, 19, 128)       147584    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 19, 19, 1)         129       
_________________________________________________________________
flatten_1 (Flatten)          (None, 361)               0         
_________________________________________________________________
biais_1 (Biais)              (None, 361)               361       
_________________________________________________________________
activation_1 (Activation)    (None, 361)               0         
=================================================================
Total params: 1,033,322
Trainable params: 1,033,322
Non-trainable params: 0
_________________________________________________________________
sur 1995017 coups et 30 epochs